## Plan Result (user-list-search-cdk)

[CI link](https://circleci.com/gh/Pocket/pocket-monorepo/194866)


### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!


<pre><code>Plan: 3 to add, 0 to change, 3 to destroy.</code></pre>

* Replace
  * aws_ecs_task_definition.apollo
  * aws_ecs_task_definition.queue_users
  * null_resource.apollo_update-task-definition



<details><summary>Change Result (Click me)</summary>

```hcl

  # aws_ecs_task_definition.apollo must be replaced
+/- resource "aws_ecs_task_definition" "apollo" {
      ~ arn                      = "arn:aws:ecs:us-east-1:996905175585:task-definition/UserListSearch-Prod-Apollo:510" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-east-1:996905175585:task-definition/UserListSearch-Prod-Apollo" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  - cpu                    = 0
                  - environment            = []
                  - mountPoints            = []
                    name                   = "aws-otel-collector"
                  ~ portMappings           = [
                      ~ {
                          - protocol      = "tcp"
                            # (2 unchanged attributes hidden)
                        },
                      ~ {
                          - protocol      = "tcp"
                            # (2 unchanged attributes hidden)
                        },
                    ]
                  - systemControls         = []
                  - volumesFrom            = []
                    # (6 unchanged attributes hidden)
                },
              ~ {
                  - cpu                    = 0
                  - mountPoints            = []
                    name                   = "node"
                  ~ secrets                = [
                        # (3 unchanged elements hidden)
                        {
                            name      = "SENTRY_DSN"
                            valueFrom = "arn:aws:ssm:us-east-1:996905175585:parameter/UserListSearch/Prod/SENTRY_DSN"
                        },
                      ~ {
                            name      = "UNLEASH_ENDPOINT"
                          ~ valueFrom = "arn:aws:ssm:us-east-1:996905175585:parameter/UserListSearch/Prod/UNLEASH_ENDPOINT" -> "arn:aws:ssm:us-east-1:996905175585:parameter/Shared/Prod/UNLEASH_ENDPOINT"
                        },
                        {
                            name      = "UNLEASH_KEY"
                            valueFrom = "arn:aws:secretsmanager:us-east-1:996905175585:secret:UserListSearch/Prod/UNLEASH_KEY"
                        },
                    ]
                  - systemControls         = []
                  - volumesFrom            = []
                    # (6 unchanged attributes hidden)
                },
            ] # forces replacement
        )
      ~ id                       = "UserListSearch-Prod-Apollo" -> (known after apply)
      ~ revision                 = 510 -> (known after apply)
        tags                     = {
            "costCenter"  = "Pocket"
            "environment" = "Prod"
            "owner"       = "Pocket"
            "service"     = "UserListSearch"
        }
        # (12 unchanged attributes hidden)
    }

  # aws_ecs_task_definition.queue_users must be replaced
-/+ resource "aws_ecs_task_definition" "queue_users" {
      ~ arn                      = "arn:aws:ecs:us-east-1:996905175585:task-definition/UserListSearch-Prod-QueueUsers:9" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-east-1:996905175585:task-definition/UserListSearch-Prod-QueueUsers" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  - cpu                    = 0
                  - environment            = []
                  - mountPoints            = []
                    name                   = "aws-otel-collector"
                  ~ portMappings           = [
                      ~ {
                          - protocol      = "tcp"
                            # (2 unchanged attributes hidden)
                        },
                      ~ {
                          - protocol      = "tcp"
                            # (2 unchanged attributes hidden)
                        },
                    ]
                  - systemControls         = []
                  - volumesFrom            = []
                    # (6 unchanged attributes hidden)
                },
              ~ {
                  - cpu                    = 0
                  - mountPoints            = []
                    name                   = "node"
                  ~ secrets                = [
                        # (3 unchanged elements hidden)
                        {
                            name      = "SENTRY_DSN"
                            valueFrom = "arn:aws:ssm:us-east-1:996905175585:parameter/UserListSearch/Prod/SENTRY_DSN"
                        },
                      ~ {
                            name      = "UNLEASH_ENDPOINT"
                          ~ valueFrom = "arn:aws:ssm:us-east-1:996905175585:parameter/UserListSearch/Prod/UNLEASH_ENDPOINT" -> "arn:aws:ssm:us-east-1:996905175585:parameter/Shared/Prod/UNLEASH_ENDPOINT"
                        },
                        {
                            name      = "UNLEASH_KEY"
                            valueFrom = "arn:aws:secretsmanager:us-east-1:996905175585:secret:UserListSearch/Prod/UNLEASH_KEY"
                        },
                    ]
                  - systemControls         = []
                  - volumesFrom            = []
                    # (7 unchanged attributes hidden)
                },
            ] # forces replacement
        )
      ~ id                       = "UserListSearch-Prod-QueueUsers" -> (known after apply)
      ~ revision                 = 9 -> (known after apply)
        tags                     = {
            "costCenter"  = "Pocket"
            "environment" = "Prod"
            "owner"       = "Pocket"
            "service"     = "UserListSearch"
        }
        # (12 unchanged attributes hidden)
    }

  # null_resource.apollo_update-task-definition must be replaced
-/+ resource "null_resource" "apollo_update-task-definition" {
      ~ id       = "8018040356952136317" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "task_arn" = "arn:aws:ecs:us-east-1:996905175585:task-definition/UserListSearch-Prod-Apollo:510" -> (known after apply)
        }
    }

Plan: 3 to add, 0 to change, 3 to destroy.

Changes to Outputs:
  ~ ecs-task-arn           = "arn:aws:ecs:us-east-1:996905175585:task-definition/UserListSearch-Prod-Apollo:510" -> (known after apply)
```

</details>









<!-- github-comment: {"Command":"plan","JobID":"d1d52c5d-1e6d-4283-877c-e49dc8cce00f","JobName":"user-list-search_infrastructure_plan_prod","PRNumber":565,"Program":"tfcmt","SHA1":"07cc6d9fa522799706f09509cf9b054371b1684c","Target":"user-list-search-cdk","Vars":{}} -->